DataProcessors/МЛК_СтраницаЗапуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>МЛК_СтраницаЗапуска</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>v8ui:Picture</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/МЛК_Комиссия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>МЛК_Комиссия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КомиссияСверху</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомиссияВСумме</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/МЛК_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>МЛК_Настройки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресКабинетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриложения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВРаботе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбработано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОтклонено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗакрыто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередаватьФамилию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерШаблонаСМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспортЛицевыеСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспортСчетчики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспортПлатежи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспортНачисления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспортКвитанции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонКвитанции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВариантыСчетовИзвещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмпортПоказанияСчетчиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичнаяСинхронизацияВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичнойСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьИнтеграцию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОтправленоВУК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейСинхронизацииПоОплатам</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МЛК_Комиссия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейСинхронизацииПоЛицевымСчетам</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейСинхронизацииПоСчетчикам</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейВыгрузкиПоНачислениям</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейВыгрузкиПоОплатам</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежныйАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплатыОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФоновыеЗадания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реквизит1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/МЛК_СтраницаЗапуска/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция ПопробоватьРаботуССистемойНаСервере()
	
	//1. Сначала получим список организаций, у которых есть лицевые счета
	ТЗОрганизаций = ПолучитьТаблицуОрганизаций();
	//2. Теперь отправим данные об организациях в 
	Для Каждого СтрОрганизаций Из ТЗОрганизаций  Цикл
		//ОтправитьЗапросЗаСозданиеПриложения(СтрОрганизаций.Организация);
		Форм = СоздатьОрганизациюИВыбратьДляНастройки(СтрОрганизаций.Организация);
		//Форм.ПолучитьФорму().Открыть();
		Возврат Форм;
		
	КонецЦикла;	 
	
	
КонецФункции 

Функция  СоздатьОрганизациюИВыбратьДляНастройки(Организация)
	
	НайденнаяСсылка = Справочники.МЛК_Настройки.НайтиПоРеквизиту("Организация",Организация);
	Если НайденнаяСсылка<>Справочники.МЛК_Настройки.ПустаяСсылка() Тогда
		Возврат НайденнаяСсылка;
	КонецЕсли;	
	
	Нов = Справочники.МЛК_Настройки.СоздатьЭлемент();
	Нов.Наименование                     = "Интеграция с МЛК " + Строка(Организация.Наименование);
	Нов.Организация                      = Организация;
	Нов.Комиссия                         = Перечисления.МЛК_Комиссия.КомиссияСверху;
	Нов.ЭкспортКвитанции                 = Истина;
	нов.ЭкспортЛицевыеСчета              = Истина;
	Нов.ЭкспортНачисления                = Истина;
	Нов.ЭкспортПлатежи                   = Истина;
	Нов.ЭкспортСчетчики                  = Истина;
	Нов.ИмпортПоказанияСчетчиков         = Истина;
	Нов.ШаблонКвитанции                  = Справочники.бит_ВариантыСчетовИзвещений.ПлатежныйДокументРК924ГИСЖКХ;
	
	Нов.Записать();
	
	
	Возврат Нов.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура ПопробоватьРаботуССистемой(Команда)
	//Форма = ПопробоватьРаботуССистемойНаСервере();
	//	//Форма = ПолучитьФорму("Справочник.МЛК_Настройки.ФормаСписка");
	//	Форма.открыть();
	Параметр = Новый Структура("Ключ",ПопробоватьРаботуССистемойНаСервере());
    Форма = ПолучитьФорму("Справочник.МЛК_Настройки.Форма.ФормаЭлемента",Параметр);
	Форма.Открыть();
	//ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуОрганизаций()
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Организация КАК Организация
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.ПометкаУдаления = ЛОЖЬ" ;
	ТЗОрганизаций = Запрос.Выполнить().Выгрузить();
	Если ТЗОрганизаций.Количество()<>0 Тогда
		ТЗОрганизаций.Свернуть("Организация","");
		Возврат ТЗОрганизаций;
	Иначе
		ТЗОрганизаций = Новый ТаблицаЗначений;
		Возврат ТЗОрганизаций;
	КонецЕсли;
	
КонецФункции	

&НаСервере
Функция УбратьНенужныеСимволы(Элемент, Символ="") Экспорт
	Перем Результат;
	Результат=Строка(Элемент);
	
	Результат = СтрЗаменить(Результат,Символы.Нпп,Символ);
	Результат = СтрЗаменить(Результат,"/",Символ);
	Результат = СтрЗаменить(Результат,"\",Символ);
	Результат = СтрЗаменить(Результат,".",Символ);
	Результат = СтрЗаменить(Результат,",",Символ);
	//Результат = СтрЗаменить(Результат,"+",Символ);
	Результат = СтрЗаменить(Результат,"-",Символ);
	Результат = СтрЗаменить(Результат,"!",Символ);
	Результат = СтрЗаменить(Результат,"@",Символ);
	Результат = СтрЗаменить(Результат,"#",Символ); 
	Результат = СтрЗаменить(Результат,"$",Символ);
	Результат = СтрЗаменить(Результат,"%",Символ);
	Результат = СтрЗаменить(Результат,"^",Символ);
	Результат = СтрЗаменить(Результат,"&",Символ);
	Результат = СтрЗаменить(Результат,"*",Символ);
	Результат = СтрЗаменить(Результат,"(",Символ);
	Результат = СтрЗаменить(Результат,")",Символ);
	Результат = СтрЗаменить(Результат,"№",Символ);
	Результат = СтрЗаменить(Результат,";",Символ);
	Результат = СтрЗаменить(Результат,":",Символ);
	Результат = СтрЗаменить(Результат,"?",Символ);
	Результат = СтрЗаменить(Результат," ",Символ);
	Возврат Результат;
	ТекНомерТелефона="";счетчик=0;ПервоеВхождение=ложь;
	Для Индекс = 1 По СтрДлина(Результат) Цикл
		Символ = Сред(Результат, Индекс, 1); 
		Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда // Код нуля - 48, код 9-ки - 57
			//ТекНомерТелефона = ТекНомерТелефона + Символ;
			Если Символ="9" и ПервоеВхождение=ложь Тогда
				ПервоеВхождение=Истина;
				
			КонецЕсли;
			Если ПервоеВхождение  Тогда
				ТекНомерТелефона = ТекНомерТелефона + Символ;
				Счетчик=Счетчик+1;
			КонецЕсли;
			Если Счетчик=10 Тогда
				ТекНомерТелефона="+7"+ТекНомерТелефона;
				Возврат ТекНомерТелефона;
			КонецЕсли;
			
		ИначеЕсли СтрДлина(ТекНомерТелефона) > 0 Тогда
			//ТекНомерТелефона = "";
		КонецЕсли;
	КонецЦикла;
	//ПервоеВхождение=СтрНайти(ТекНомерТелефона,"9");
	//Если ПервоеВхождение>0 Тогда
	//	Результат=Сред(ТекНомерТелефона,ПервоеВхождение,10);
	//	Если СтрДлина(СокрЛП(Результат))=10 Тогда Результат="+7"+Результат;
	//		Возврат Результат;
	//	Иначе Результат=""; Возврат Результат;
	//	КонецЕсли;
	//Иначе Результат=""; Возврат Результат;
	//КонецЕсли
	
КонецФункции

&НаСервере
Процедура ПоказатьПозжеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПозже(Команда)
	ПоказатьПозжеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЧерезПятьДнейНаСервере()
	// Записать константу
	СледующаяДата = ТекущаяДата() + (60*60*24*7);
	Константы.МЛК_ДатаСледующегоПоказа.Установить(СледующаяДата);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧерезПятьДней(Команда)
	ЧерезПятьДнейНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция ПриОткрытииНаСервере()

	//ЕстьСОединение = ПроверитьДоступностьСистемы();	
	//Если Не ЕстьСОединение Тогда
	//	Возврат Ложь; //Истина не открывать форму
	//КонецЕсли;	

	Возврат константы.МЛК_ИспользоватьИнтеграциюСМобильнымиЛичнымиКабинетами.Получить();
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Ответ = ПриОткрытииНаСервере();
	
	Если Ответ Тогда
		Отказ=истина;
	Иначе
		Если ПроверитьДату() Тогда
			ТабДок = ВыполнитьНаСервере();
		Иначе	
			Отказ=истина;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Функция ПроверитьДату()
	Если Не ЗначениеЗаполнено(Константы.МЛК_ДатаСледующегоПоказа.Получить()) Тогда
		Возврат Истина;
	Иначе
		Если НачалоДня(ТекущаяДата())>=НачалоДня(Константы.МЛК_ДатаСледующегоПоказа.Получить()) Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
КонецФункции	

Функция ВыполнитьНаСервере()
	
	ТД = ВебСодержимое;
	Обработка = РеквизитФормыВЗначение("Объект");
	Макет = Обработка.получитьМакет("Макет");
	Область = Макет.ПолучитьОбласть("Картинка");
	ТД.Вывести(Область);
	ТД.ТолькоПросмотр = Истина;
	Возврат ТД;
	
КонецФункции	

Функция ПроверитьДоступностьСистемы()
	
	//АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
	//АдресРесурса = "/api/v4/objects?ApplicationId="+Настройки.НомерПриложения;
	//
	//HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
	//HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Настройки.Токен));
	//HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
	ДанныеДляПарсера = "c92ae251803621fd4f487f68f3fe3158"+":"+"2760b0fb01adb00f940c1f6fb0458faa"; //КодироватьСтроку(
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла,"CESU-8");
	ЗаписьТекста.Записать(ДанныеДляПарсера);
	ЗаписьТекста.Закрыть();
	
	СтрокаТокен = Новый ДвоичныеДанные(ИмяВременногоФайла);
	Токен = Base64Строка(СтрокаТокен);
	Токен = СтрЗаменить(Токен,"¶","");
	Токен = СтрЗаменить(Токен,Символ(10),"");
	Токен = СтрЗаменить(Токен,Символ(13),"");
	УдалитьФайлы(ИмяВременногоФайла);
	
	АдресСервисаСтр = "testbit-admin.moe-zkx.ru";
	//АдресСервисаСтр = "mobsted.mobsted.ru";
	
	Соединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
	
	Запрос        = Новый HTTPЗапрос("/api/v4/applications/717");
	Запрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Токен));
	//Запрос.Заголовки.Вставить("cache-control", "no-cache");  
	
	ЖурналВремяНачало = ТекущаяДата();
	ЖурналЗапросБезКодировки   = Строка(АдресСервисаСтр)+Строка("/api/v4/applications/717");
	
	Результат    = Соединение.Получить(Запрос);
	Если Результат.КодСостояния <> 200 Тогда 
		ИмяСобытияВЖурнал = "Получение ключа для создания агента";
		КодСостояния = Результат.КодСостояния;
		СтрокаОтвета = Результат.ПолучитьТелоКакСтроку();;	
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало,ТекущаяДата(),Неопределено);	
		Возврат ложь;
	Иначе
		
		РезультатПроверки = Результат.ПолучитьТелоКакСтроку();;	
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
		ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
		ЧтениеJSON.Закрыть();
		
		Ответ = ЗагруженныеДанные["FullDescription"];
		Если Ответ <> "stop" Тогда
		Возврат Истина;
		Иначе
		Возврат ложь;
		КонецЕсли;	
		
		
	КонецЕсли; 
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ФайлКартинки = Объект.ФайлКартинки;
	//Если НЕ ФайлКартинки.Пустая() Тогда
	//АдресКартинки = ПолучитьНавигационнуюСсылку(ФайлКартинки, "ДанныеФайла")
	//Конецесли;
КонецПроцедуры
&НаСервере
Процедура ОбновитьИзображение()
	
	//// Конвертируем объект формы в объект справочника, чтобы 
	////можно было работать с реквизитом типа "Хранилище значений"
	//ОбъектЭлемента = РеквизитФормыВЗначение("Объект");	
	//
	//// Помещаем двоичные данные из реквизита во временное хранилище. 
	////Адрес из хранилища помещаем в строковой реквизит
	//// формы "Фото сотрудника"
	//Фото = ПоместитьВоВременноеХранилище(ОбъектЭлемента.ВэбСОдержимое.Получить(), 
	//											   УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнструкцию(Команда)
	ЗапуститьПриложение("https://www.moe-zkx.ru/bit/zapusk");
КонецПроцедуры
